export const ACCORDION_DATA = [
	{
		title: 'Virtual DOM',
		text: 'Virtual DOM - это виртуальный представитель HTML-дерева, который используется React для управления изменениями в пользовательском интерфейсе. Это позволяет реактивно и эффективно обновлять интерфейс пользователя.',
	},
	{
		title: 'Components',
		text: 'Components - это основные строительные блоки приложения React. Компоненты могут быть представлены как функциональные компоненты или классовые компоненты, которые представляют собой независимые части пользовательского интерфейса.',
	},
	{
		title: 'JSX',
		text: 'JSX - это специальный синтаксис, который позволяет писать HTML-код внутри JavaScript. Он используется для описания компонентов в React.',
	},
	{
		title: 'Props',
		text: 'Props - это параметры, которые передаются из родительского компонента в дочерний.',
	},
	{
		title: 'SPA',
		text: 'SPA (Single Page Application) - это тип веб-приложения, которое загружает единственную HTML-страницу при первой загрузке и динамически обновляет ее контент без необходимости полной перезагрузки страницы при переходе между различными "страницами" в приложении. Вместо этого SPA использует асинхронные запросы к серверу (часто с использованием AJAX) для получения данных и обновления содержимого страницы.',
	},
];
